In [1]:
import pandas as pd
import sqlite3

In [2]:
con = sqlite3.connect('db')

In [43]:
data = [[101, 'John', 'A', None], [102, 'Dan', 'A', 101], [103, 'James', 'A', 101], [104, 'Amy', 'A', 101], [105, 'Anne', 'A', 101], [106, 'Ron', 'B', 101], [107, 'Tom', 'A', 102], [108, 'John', 'A', None], [109, 'Tommy', 'A', 108], [110, 'Peter', 'C', 108], [111, 'Dong', 'A', 108], [112, 'DIDI', 'D', 108], [113, 'Wowka', 'A', 108]]
employee = pd.DataFrame(data, columns=['id', 'name', 'department', 'managerId']).astype({'id':'Int64', 'name':'object', 'department':'object', 'managerId':'Int64'})

In [44]:
employee.to_sql('employee', con, index=False, if_exists='replace')

13

In [45]:
sql1 = '''
        select * from employee
'''

In [46]:
pd.read_sql(sql1, con)

     id   name department  managerId
0   101   John          A        NaN
1   102    Dan          A      101.0
2   103  James          A      101.0
3   104    Amy          A      101.0
4   105   Anne          A      101.0
5   106    Ron          B      101.0
6   107    Tom          A      102.0
7   108   John          A        NaN
8   109  Tommy          A      108.0
9   110  Peter          C      108.0
10  111   Dong          A      108.0
11  112   DIDI          D      108.0
12  113  Wowka          A      108.0

In [65]:
sql = '''
    select name
    from employee
    where id in 
       (select managerId 
       from employee 
       group by managerId
       having count(id) >= 5)
        
'''

In [66]:
pd.read_sql(sql, con)

   name
0  John
1  John